using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace JapaneseStringConverter.Test
{
    internal static class TestSources
    {
        /// <summary>
        /// [0]: カタカナ, [1]: ひらがな
        /// </summary>
        public static readonly string[][] KanaTransrate = new string[][] {
            new[] { "アイウエオ", "あいうえお" },
            new[] { "ガギグゲゴ", "がぎぐげご" },
            new[] { "ＡＢＣ", "ＡＢＣ" },
            new[]
            {
                " !\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~\r\n",
                " !\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~\r\n"
            },
            new[]
            {
                "　！＂＃＄％＆＇（）＊＋，－．／０１２３４５６７８９：；＜＝＞？＠ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ［＼］＾＿｀ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ｛｜｝～",
                "　！＂＃＄％＆＇（）＊＋，－．／０１２３４５６７８９：；＜＝＞？＠ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ［＼］＾＿｀ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ｛｜｝～",
           },
            new[]
            {
                "ｧｱｨｲｩｳｪｴｫｵｶｶﾞｷｷﾞｸｸﾞｹｹﾞｺｺﾞｻｻﾞｼｼﾞｽｽﾞｾｾﾞｿｿﾞﾀﾀﾞﾁﾁﾞｯﾂﾂﾞﾃﾃﾞﾄﾄﾞﾅﾆﾇﾈﾉﾊﾊﾞﾊﾟﾋﾋﾞﾋﾟﾌﾌﾞﾌﾟﾍﾍﾞﾍﾟﾎﾎﾞﾎﾟﾏﾐﾑﾒﾓｬﾔｭﾕｮﾖﾗﾗﾟﾘﾘﾟﾙﾙﾟﾚﾚﾟﾛﾛﾟﾜﾜﾞｦｦﾞﾝｳﾞ",
                "ｧｱｨｲｩｳｪｴｫｵｶｶﾞｷｷﾞｸｸﾞｹｹﾞｺｺﾞｻｻﾞｼｼﾞｽｽﾞｾｾﾞｿｿﾞﾀﾀﾞﾁﾁﾞｯﾂﾂﾞﾃﾃﾞﾄﾄﾞﾅﾆﾇﾈﾉﾊﾊﾞﾊﾟﾋﾋﾞﾋﾟﾌﾌﾞﾌﾟﾍﾍﾞﾍﾟﾎﾎﾞﾎﾟﾏﾐﾑﾒﾓｬﾔｭﾕｮﾖﾗﾗﾟﾘﾘﾟﾙﾙﾟﾚﾚﾟﾛﾛﾟﾜﾜﾞｦｦﾞﾝｳﾞ"
            },
            new[]
            {
                "ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨララ゚リリ゚ルル゚レレ゚ロロ゚ヮワヷヰヸヱヹヲヺンヴヵヶヽヾ" ,
                "ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらら゚りり゚るる゚れれ゚ろろ゚ゎわわ゙ゐゐ゙ゑゑ゙をを゙んゔゕゖゝゞ"
            },
            new[]
            {
                "ァ゙ア゙ィ゙イ゙ゥ゙ヴェ゙エ゙ォ゙オ゙ガガ゙ギギ゙ググ゙ゲゲ゙ゴゴ゙ザザ゙ジジ゙ズズ゙ゼゼ゙ゾゾ゙ダダ゙ヂヂ゙ッ゙ヅヅ゙デデ゙ドド゙ナ゙ニ゙ヌ゙ネ゙ノ゙ババ゙パ゙ビビ゙ピ゙ブブ゙プ゙ベベ゙ペ゙ボボ゙ポ゙マ゙ミ゙ム゙メ゙モ゙ャ゙ヤ゙ュ゙ユ゙ョ゙ヨ゙ラ゙リ゙ル゙レ゙ロ゙ヮ゙ヷヸヹヺン゙ヴ゙ヵ゙ヶ゙ヾヾ゙",
                "ぁ゙あ゙ぃ゙い゙ぅ゙ゔぇ゙え゙ぉ゙お゙がが゙ぎぎ゙ぐぐ゙げげ゙ごご゙ざざ゙じじ゙ずず゙ぜぜ゙ぞぞ゙だだ゙ぢぢ゙っ゙づづ゙でで゙どど゙な゙に゙ぬ゙ね゙の゙ばば゙ぱ゙びび゙ぴ゙ぶぶ゙ぷ゙べべ゙ぺ゙ぼぼ゙ぽ゙ま゙み゙む゙め゙も゙ゃ゙や゙ゅ゙ゆ゙ょ゙よ゙ら゙り゙る゙れ゙ろ゙ゎ゙わ゙ゐ゙ゑ゙を゙ん゙ゔ゙ゕ゙ゖ゙ゞゞ゙",
            },
            new[]
            {
                "ァ゚ア゚ィ゚イ゚ゥ゚ウ゚ェ゚エ゚ォ゚オ゚カ゚ガ゚キ゚ギ゚ク゚グ゚ケ゚ゲ゚コ゚ゴ゚サ゚ザ゚シ゚ジ゚ス゚ズ゚セ゚ゼ゚ソ゚ゾ゚タ゚ダ゚チ゚ヂ゚ッ゚ツ゚ヅ゚テ゚デ゚ト゚ド゚ナ゚ニ゚ヌ゚ネ゚ノ゚パバ゚パ゚ピビ゚ピ゚プブ゚プ゚ペベ゚ペ゚ポボ゚ポ゚マ゚ミ゚ム゚メ゚モ゚ャ゚ヤ゚ュ゚ユ゚ョ゚ヨ゚ラ゚リ゚ル゚レ゚ロ゚ヮ゚ワ゚ヰ゚ヱ゚ヲ゚ン゚ヴ゚ヵ゚ヶ゚ヽ゚ヾ゚",
                "ぁ゚あ゚ぃ゚い゚ぅ゚う゚ぇ゚え゚ぉ゚お゚か゚が゚き゚ぎ゚く゚ぐ゚け゚げ゚こ゚ご゚さ゚ざ゚し゚じ゚す゚ず゚せ゚ぜ゚そ゚ぞ゚た゚だ゚ち゚ぢ゚っ゚つ゚づ゚て゚で゚と゚ど゚な゚に゚ぬ゚ね゚の゚ぱば゚ぱ゚ぴび゚ぴ゚ぷぶ゚ぷ゚ぺべ゚ぺ゚ぽぼ゚ぽ゚ま゚み゚む゚め゚も゚ゃ゚や゚ゅ゚ゆ゚ょ゚よ゚ら゚り゚る゚れ゚ろ゚ゎ゚わ゚ゐ゚ゑ゚を゚ん゚ゔ゚ゕ゚ゖ゚ゝ゚ゞ゚"
            },
            new[] { "ラ゚ラ゚ラ゚ラ゚", "ら゚ら゚ら゚ら゚" },
            new[] { "ヷヸヹヺ", "わ゙ゐ゙ゑ゙を゙" }
        };

        /// <summary>
        /// [0]: input, [1] expected
        /// </summary>
        public static readonly string[][] Hiragana = new string[][]
        {
            new[]
            {
                "ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらら゚りり゚るる゚れれ゚ろろ゚ゎわわ゙ゐゐ゙ゑゑ゙をを゙んゔゕゖゝゞ",
                "ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらら゚りり゚るる゚れれ゚ろろ゚ゎわわ゙ゐゐ゙ゑゑ゙をを゙んゔゕゖゝゞ"
            },
        };

        /// <summary>
        /// [0]: expected, [1]: input
        /// </summary>
        public static readonly string[][] Katakana = new string[][]
        {
            new[]
            {
                "ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨララ゚リリ゚ルル゚レレ゚ロロ゚ヮワヷヰヸヱヹヲヺンヴヵヶヽヾ" ,
                "ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨララ゚リリ゚ルル゚レレ゚ロロ゚ヮワヷヰヸヱヹヲヺンヴヵヶヽヾ"
            },
        };

        /// <summary>
        /// [0]: 半角, [1]: 全角
        /// </summary>
        public static readonly string[][] WideNarrowTranslate = new string[][] {
            new[] { "ｱｲｳ", "アイウ" },
            new[] { "abcDEF", "ａｂｃＤＥＦ" },
            new[] { "ｶﾞｷﾞｸﾞ", "ガギグ" },
            new[] { "ﾊﾟﾋﾟﾌﾟ", "パピプ" },
            new[] { "ヰヸヱヹ", "ヰヸヱヹ" },
            new[] { "ｺｺﾞｻｻﾞｼｼﾞｽｽﾞｾｾﾞｿｿﾞ", "コゴサザシジスズセゼソゾ" },
            new[] { " ", "　" },
            new[]
            {
                " !\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~",
                "　！＂＃＄％＆＇（）＊＋，－．／０１２３４５６７８９：；＜＝＞？＠ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ［￥］＾＿｀ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ｛｜｝～"
            },
            new[]
            {
                "ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをん",
                "ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをん"
            },
            new[]
            {
                "ｧｱｨｲｩｳｪｴｫｵｶｶﾞｷｷﾞｸｸﾞｹｹﾞｺｺﾞｻｻﾞｼｼﾞｽｽﾞｾｾﾞｿｿﾞﾀﾀﾞﾁﾁﾞｯﾂﾂﾞﾃﾃﾞﾄﾄﾞﾅﾆﾇﾈﾉﾊﾊﾞﾊﾟﾋﾋﾞﾋﾟﾌﾌﾞﾌﾟﾍﾍﾞﾍﾟﾎﾎﾞﾎﾟﾏﾐﾑﾒﾓｬﾔｭﾕｮﾖﾗﾗﾟﾘﾘﾟﾙﾙﾟﾚﾚﾟﾛﾛﾟヮﾜﾜﾞヰヸヱヹｦｦﾞﾝｳﾞヵヶヽヾ",
                "ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨララ゚リリ゚ルル゚レレ゚ロロ゚ヮワヷヰヸヱヹヲヺンヴヵヶヽヾ",
            },
            new[]
            {
                 "¢£\\¦¬¯₩｡｢｣､･￩￪￫￬￭￮ｰ",
                 "￠￡￥￤￢￣￦。「」、・←↑→↓■○ー",
            }
        };

        /// <summary>
        /// [0]: input, [1] expected
        /// </summary>
        public static readonly string[][] Wide = new string[][]
        {
            new[]
            {
                "ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨララ゚リリ゚ルル゚レレ゚ロロ゚ヮワヷヰヸヱヹヲヺンヴヵヶヽヾ",
                "ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨララ゚リリ゚ルル゚レレ゚ロロ゚ヮワヷヰヸヱヹヲヺンヴヵヶヽヾ"
            },
            new[]
            {
                "　！＂＃＄％＆＇（）＊＋，－．／０１２３４５６７８９：；＜＝＞？＠ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ［＼￥］＾＿｀ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ｛｜｝～",
                "　！＂＃＄％＆＇（）＊＋，－．／０１２３４５６７８９：；＜＝＞？＠ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ［＼￥］＾＿｀ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ｛｜｝～"
            },
            new[]
            {
                "¥",
                "￥"
            },
        };

        /// <summary>
        /// [0]: expected, [1]: input
        /// </summary>
        public static readonly string[][] Narrow = new string[][]
        {
            new[]
            {
                "ｧｱｨｲｩｳｪｴｫｵｶｶﾞｷｷﾞｸｸﾞｹｹﾞｺｺﾞｻｻﾞｼｼﾞｽｽﾞｾｾﾞｿｿﾞﾀﾀﾞﾁﾁﾞｯﾂﾂﾞﾃﾃﾞﾄﾄﾞﾅﾆﾇﾈﾉﾊﾊﾞﾊﾟﾋﾋﾞﾋﾟﾌﾌﾞﾌﾟﾍﾍﾞﾍﾟﾎﾎﾞﾎﾟﾏﾐﾑﾒﾓｬﾔｭﾕｮﾖﾗﾗﾟﾘﾘﾟﾙﾙﾟﾚﾚﾟﾛﾛﾟヮﾜﾜﾞヰヸヱヹｦｦﾞﾝｳﾞヵヶヽヾ",
                "ｧｱｨｲｩｳｪｴｫｵｶｶﾞｷｷﾞｸｸﾞｹｹﾞｺｺﾞｻｻﾞｼｼﾞｽｽﾞｾｾﾞｿｿﾞﾀﾀﾞﾁﾁﾞｯﾂﾂﾞﾃﾃﾞﾄﾄﾞﾅﾆﾇﾈﾉﾊﾊﾞﾊﾟﾋﾋﾞﾋﾟﾌﾌﾞﾌﾟﾍﾍﾞﾍﾟﾎﾎﾞﾎﾟﾏﾐﾑﾒﾓｬﾔｭﾕｮﾖﾗﾗﾟﾘﾘﾟﾙﾙﾟﾚﾚﾟﾛﾛﾟヮﾜﾜﾞヰヸヱヹｦｦﾞﾝｳﾞヵヶヽヾ"
            },
            new[]
            {
                " !\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~",
                " !\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~"
            },
        };
    }
}
