//using System.Collections.Immutable;

//namespace JapaneseStringConverter
//{
//    public class CharacterUtility
//    {
//        /// <summary>
//        /// ひらがなの配列を返します
//        /// </summary>
//        public static readonly ImmutableArray<char> HiraganaChars = ImmutableArray.Create(
//                'ぁ', 'あ', 'ぃ', 'い', 'ぅ', 'う', 'ぇ', 'え', 'ぉ', 'お',
//                'か', 'が', 'き', 'ぎ', 'く', 'ぐ', 'け', 'げ', 'こ', 'ご',
//                'さ', 'ざ', 'し', 'じ', 'す', 'ず', 'せ', 'ぜ', 'そ', 'ぞ',
//                'た', 'だ', 'ち', 'ぢ', 'っ', 'つ', 'づ', 'て', 'で', 'と', 'ど',
//                'な', 'に', 'ぬ', 'ね', 'の',
//                'は', 'ば', 'ぱ', 'ひ', 'び', 'ぴ', 'ふ', 'ぶ', 'ぷ', 'へ', 'べ', 'ぺ', 'ほ', 'ぼ', 'ぽ',
//                'ま', 'み', 'む', 'め', 'も',
//                'ゃ', 'や', 'ゅ', 'ゆ', 'ょ', 'よ',
//                'ら', 'り', 'る', 'れ', 'ろ',
//                'ゎ', 'わ', 'ゐ', 'ゑ', 'を', 'ん',
//                'ゔ', 'ゕ', 'ゖ', 'ゝ', 'ゞ', 'ゟ');

//        /// <summary>
//        /// 複合文字も含めたひらがなの配列を返します
//        /// </summary>
//        public static readonly ImmutableArray<string> HiraganaCharsIncludeCombined = ImmutableArray.Create(
//                "ぁ", "あ", "ぃ", "い", "ぅ", "う", "ぇ", "え", "ぉ", "お",
//                "か", "が", "き", "ぎ", "く", "ぐ", "け", "げ", "こ", "ご",
//                "さ", "ざ", "し", "じ", "す", "ず", "せ", "ぜ", "そ", "ぞ",
//                "た", "だ", "ち", "ぢ", "っ", "つ", "づ", "て", "で", "と", "ど",
//                "な", "に", "ぬ", "ね", "の",
//                "は", "ば", "ぱ", "ひ", "び", "ぴ", "ふ", "ぶ", "ぷ", "へ", "べ", "ぺ", "ほ", "ぼ", "ぽ",
//                "ま", "み", "む", "め", "も",
//                "ゃ", "や", "ゅ", "ゆ", "ょ", "よ",
//                "ら", "ら゚", "り", "り゚", "る", "る゚", "れ", "れ゚", "ろ", "ろ゚",
//                "ゎ", "わ", "わ゙", "ゐ", "ゐ゙", "ゑ", "ゑ゙", "を", "を゙", "ん",
//                "ゔ", "ゕ", "ゖ", "ゝ", "ゞ", "ゟ");

//        // TODO 半角追加
//        /// <summary>
//        /// カタカナの配列を返します
//        /// </summary>
//        public static readonly ImmutableArray<char> KatakanaChars = ImmutableArray.Create(
//                '゠', 
//                'ァ', 'ア', 'ィ', 'イ', 'ゥ', 'ウ', 'ェ', 'エ', 'ォ', 'オ', 
//                'カ', 'ガ', 'キ', 'ギ', 'ク', 'グ', 'ケ', 'ゲ', 'コ', 'ゴ', 
//                'サ', 'ザ', 'シ', 'ジ', 'ス', 'ズ', 'セ', 'ゼ', 'ソ', 'ゾ', 
//                'タ', 'ダ', 'チ', 'ヂ', 'ッ', 'ツ', 'ヅ', 'テ', 'デ', 'ト', 'ド', 
//                'ナ', 'ニ', 'ヌ', 'ネ', 'ノ', 
//                'ハ', 'バ', 'パ', 'ヒ', 'ビ', 'ピ', 'フ', 'ブ', 'プ', 'ヘ', 'ベ', 'ペ', 'ホ', 'ボ', 'ポ', 
//                'マ', 'ミ', 'ム', 'メ', 'モ', 
//                'ャ', 'ヤ', 'ュ', 'ユ', 'ョ', 'ヨ', 
//                'ラ', 'リ', 'ル', 'レ', 'ロ',  
//                'ヮ', 'ワ', 'ヰ', 'ヱ', 'ヲ', 'ン', 
//                'ヴ', 'ヵ', 'ヶ', 'ヷ', 'ヸ', 'ヹ', 'ヺ', 
//                '・', 'ー', 'ヽ', 'ヾ', 'ヿ');

//        /// <summary>
//        /// 複合文字も含めたカタカナの配列を返します
//        /// </summary>
//        public static readonly ImmutableArray<string> KatakanaCharsIncludeCombined = ImmutableArray.Create(
//                "゠", 
//                "ァ", "ア", "ィ", "イ", "ゥ", "ウ", "ェ", "エ", "ォ", "オ", 
//                "カ", "ガ", "キ", "ギ", "ク", "グ", "ケ", "ゲ", "コ", "ゴ", 
//                "サ", "ザ", "シ", "ジ", "ス", "ズ", "セ", "ゼ", "ソ", "ゾ", 
//                "タ", "ダ", "チ", "ヂ", "ッ", "ツ", "ヅ", "テ", "デ", "ト", "ド", 
//                "ナ", "ニ", "ヌ", "ネ", "ノ", 
//                "ハ", "バ", "パ", "ヒ", "ビ", "ピ", "フ", "ブ", "プ", "ヘ", "ベ", "ペ", "ホ", "ボ", "ポ", 
//                "マ", "ミ", "ム", "メ", "モ", 
//                "ャ", "ヤ", "ュ", "ユ", "ョ", "ヨ", 
//                "ラ", "ラ゚", "リ", "リ゚", "ル", "ル゚", "レ", "レ゚", "ロ", "ロ゚", 
//                "ヮ", "ワ", "ヰ", "ヱ", "ヲ", "ン", 
//                "ヴ", "ヵ", "ヶ", "ヷ", "ヸ", "ヹ", "ヺ", 
//                "・", "ー", "ヽ", "ヾ", "ヿ");
//    }
//}
